National_bank_xml/PRISTIGAO_RTGS.XML

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>pHjqubyKXSDrhmYtS4fRbvh5pxj+XJXQhulSxE74vlsJhJcBJiAgW6BGwyqCRSVa7pTmLzSm258W&#13;
91GCTm1gwdmfwHywq+sEOJADf8l0qBlNxusFFf1dFT8ZStClBOB9kKN0zcjSCbODq6QG62gQtHds&#13;
bfdbIo/KtR6hqI4CHUA=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>jgA9zJhfmxKu1a+kDWEtAEX2TKDm9HacUrYYZc58NIhm5li0TwmzIFMrw0lAWiS/WXWAAuX5GlCU&#13;
XZY1ay4pNCBoMC3/HuFumjU0h8SLwp83+Su4V+K35/Dj6oGVSHzZM8+1NIm8dopO024e7Y6cKzO/&#13;
El9ubI6D4qOGos+ul/A9oU6MD3utk00Vfg5Agfy306zWW18KANDaFAz8e+a6tq1KUpXhCMIfu0eK&#13;
tRj0tIL22V22mrOJrMAeVh7FsG3YyhPymMgvmgYXAAwz4k7ZOVKJPHKDRAALXPC1sUrJicFZSmDB&#13;
Ka3pij0bAL0+WjvDP0lZ97pIZy6K23m66i+Drm2SBrSfqdmKNQE8dxMUgdIbx1gQlorCTGYXccY3&#13;
53fLUxhIeVvSGhGU5GtcbzF/RkaggMl4fKzWZUnBme4b2fgSuY3meL3VLH/KL5HYCmCHr/j6JOka&#13;
h9MGcy8NnWQz452+gr9ZvLWSMnaqFfJThbGLfXvxVA1gCW2VfQCj6SBdmuRnAfYN2XqZ0LaKo11g&#13;
knA2Hl31v+zI2wXpETEH2pPpUW+28mgdlmsX4y1gKI9BnDe0ImZXucMqKSFHviR8Cum0SB8YEE/v&#13;
fUVbBmdnZS6cympXNBCvHUP+klHKq16tj2Tx3ULAbLDze3yyTlFtGl71OMUUCyzB2u5rHnwBxod5&#13;
Bothgycf1tjX0Ha51c4DWo7BvF7m4Er/EtJhfBDlaUmr9wWRyfQton6Md/22hr2HofZnR9FxU9t3&#13;
ZVwVrjyH0KNwnEWL5Zf2iE32KJWEA51CftKQ31dPL6OdfrsBS+LWiOEsQMklIHLLtr3xC6KWtrMX&#13;
DlQ/RHG8D6e7xm2iVSy4CbKChx5tYyzhfM93y087Z2cE26YDPebcMOXTWw3eqkNDxQwqiJ4ZcZPa&#13;
XdjLprxHX2SKzjAN3htupDeaoOyFNypj+icGDPPwmdh4faFAGohwPl3ngZGc6uy3aIR/YEMN1Q9/&#13;
ZqPqgl+ypfZHiscI9RvZlTDJmGRSMV6fn+8UGsN9Xd0FXcRtRPDoTM92t9IPhoi4PvGJBteES8Mu&#13;
9RYNpnbLCcug50HzQxNy+McLwDBw9tHAH7eH/Dj73zpNX5DFzVnoARLpvRqr59h9PrnPG3VRcsPR&#13;
PIwsttv0tjea4ul1Uz0/JSwoDDEy1ZHUN569URyAkbvgxGk6oqHkRpGPgpD02fm0eEV5sGjmewmk&#13;
96qhIzL1A1Imy2X3cw6oY94ZcQGO+H9efMJoXPLqmZempIAqWAMgHd2Mj3rxWeinuViKRMSp41tQ&#13;
7k6k+0KseQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>Cq8zSz/ZdDcw5X+D7zEEkm0Gk9U=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
bcxwtNI2Uwds9IjXi5uJqRAP17Y0uG9blAHIR7SwdQb8VesG/OZG+ERGe/Xc/K/lBCCRpyP43kuw&#13;
s7L/+aAjq/QRfl1oGjsiPmKLszuNYt7EW2FKi7rNOky44dndTBgpR87XFzUFlz4Dpy6DPQ3oUv25&#13;
zQYuvU76P9Qqqorjx20=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>